Dlubal.RFEM5.INodalSupport
Interface for working with nodal support

Dlubal.RFEM5.INodalSupport.GetData
Gets nodal support parameters.
Returns: Nodal support parameters.

Dlubal.RFEM5.INodalSupport.SetData(System.UInt32@)
Sets nodal support parameters.
Support: Nodal support parameters.

Dlubal.RFEM5.INodalSupport.Delete
Deletes nodal support.

Dlubal.RFEM5.INodalSupport.GetNonlinearity(System.UInt32)
Gets interface for working with nodal support nonlinearity.
Returns: Nonlinearity interface.
Direction: Nonlinearity direction.